app/controllers/home_controller.rb

SELECT * FROM "datasheets" WHERE ("datasheets"."file_file_name" = 'Austin Museums.csv') LIMIT 1
INSERT INTO "datasheets" ("created_at", "file_content_type", "file_file_size", "file_category", "updated_at", "file_file_name", "file_updated_at", "file_type") VALUES('2011-04-17 19:58:22', 'text/csv', 997, NULL, '2011-04-17 19:58:22', 'Austin Museums.csv', '2011-04-17 19:58:22', NULL)
---
  def website
    if request.post?
      spreadsheet = Datasheet.first(:conditions => {:file_file_name => params[:spreadsheet][:file].original_filename})
      spreadsheet = Datasheet.create(params[:spreadsheet]) if spreadsheet.nil?